# Datos del titanic

In [3]:
import seaborn as sns

In [6]:
import numpy as np
import pandas as pd

In [4]:
titanic = sns.load_dataset("titanic")

In [5]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [12]:
titanic.shape

(891, 15)

Con `pd.Categorical` transformamos una variable a tipo factor

In [7]:
titanic["survived"] = pd.Categorical(titanic["survived"])

In [8]:
titanic["pclass"] = pd.Categorical(titanic["pclass"])

In [9]:
titanic["sibsp"] = pd.Categorical(titanic["sibsp"])
titanic["embark_town"] = pd.Categorical(titanic["embark_town"])
titanic["embarked"] = pd.Categorical(titanic["embarked"])
titanic["parch"] = pd.Categorical(titanic["parch"])
titanic["adult_male"] = pd.Categorical(titanic["adult_male"])
titanic["deck"] = pd.Categorical(titanic["deck"])
titanic["alone"] = pd.Categorical(titanic["alone"])

# Tablas de contingencia de una variable

In [10]:
tab = pd.crosstab(index = titanic["survived"],
                 columns = "pasajeros")
tab

col_0     pasajeros
survived
0               549
1               342

In [14]:
type(tab)

pandas.core.frame.DataFrame

In [15]:
pd.crosstab(index = titanic["pclass"],
           columns = "pasajeros")

col_0   pasajeros
pclass
1             216
2             184
3             491